nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32
backbone:
  [ [ -1, 1, CBH, [ 32, 3, 2 ] ],
    [ -1, 1, LC_Block, [ 64, 2, 3, False ] ],
    [ -1, 1, LC_Block, [ 64, 1, 3, False ] ],
    [ -1, 1, LC_Block, [ 128, 2, 3, False ] ],
    [ -1, 1, LC_Block, [ 128, 1, 3, False ] ],
    [ -1, 1, LC_Block, [ 128, 1, 3, False ] ],
    [ -1, 1, LC_Block, [ 128, 1, 3, False ] ],
    [ -1, 1, LC_Block, [ 256, 2, 3, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 256, 1, 5, False ] ],
    [ -1, 1, LC_Block, [ 512, 2, 5, True ] ],
    [ -1, 1, LC_Block, [ 512, 1, 5, True ] ],
    [ -1, 1, Dense, [ 512, 1, 0.2 ] ],
  ]
head:
  [ [-1, 1, Conv, [256, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 12 ], 1, Concat, [ 1 ] ],
    [-1, 1, C3, [256, False]],
    [-1, 1, Conv, [128, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ [ -1, 6 ], 1, Concat, [ 1 ] ],
    [-1, 1, C3, [128, False]],
    [ -1, 1, LC_Block, [ 128, 2, 5, True ] ],
    [ [ -1, 22 ], 1, Concat, [ 1 ] ],
    [-1, 1, C3, [256, False]],
    [ -1, 1, LC_Block, [ 256, 2, 5, True ] ],
    [ [ -1, 18 ], 1, Concat, [ 1 ] ],
    [-1, 1, C3, [512, False]],
    [ [ 25, 28, 31 ], 1, Detect, [ nc, anchors ] ],
  ]
